# Определение компилятора (gcc для Linux, g++ для Windows)
CXX=gcc

# Определение команды удаления и расширение файла в зависимости от ОС
ifeq ($(OS),Windows_NT)
	RM=del
	EXT=.exe
else
	RM=rm
	EXT=

endif
#Правило сборки исполняемого файла из объектных.
#CXX - переменная для команды компилятора. (По умолчанию g++.)
m$(EXT): m.o
	$(CXX) -o m$(EXT) m.o
	
#Правило компиляции исходного файла в объектный
m.o: m.c
	$(CXX) -c m.c

#Фиктивное правило для очистки каталога от созданных в процессе сборки файлов.
#Для его вызова нужно указать clean после команды make.
.PHONY: clean
clean:
	$(RM) m.o m$(EXT)
